# Going through script in https://wesmckinney.com/book/

In [174]:
import pandas as pd
import numpy as np

In [2]:
print(pd.__version__)

1.4.2

In [4]:
print(np.__version__)

1.22.3

In [5]:
df = pd.DataFrame({"key1" : ["a", "a", None, "b", "b", "a", None],
                   "key2" : pd.Series([1, 2, 1, 2, 1, None, 1], dtype="Int64"),
                   "data1" : np.random.standard_normal(7),
                   "data2" : np.random.standard_normal(7)})

In [6]:
df

   key1  key2     data1     data2
0     a     1 -1.162471  1.090237
1     a     2 -0.686401 -1.510048
2  None     1 -1.546650 -1.180442
3     b     2 -1.047807 -0.801112
4     b     1 -1.630128  1.164875
5     a  <NA>  0.132858  0.106670
6  None     1 -0.713091  0.500120

In [7]:
grouped = df["data1"].groupby(df["key1"])

In [8]:
grouped

In [9]:
grouped.mean()

key1
a   -0.572005
b   -1.338967
Name: data1, dtype: float64

In [10]:
means = df["data1"].groupby([df["key1"], df["key2"]]).mean()

In [11]:
means

key1  key2
a     1      -1.162471
      2      -0.686401
b     1      -1.630128
      2      -1.047807
Name: data1, dtype: float64

In [12]:
means.unstack()

key2         1         2
key1
a    -1.162471 -0.686401
b    -1.630128 -1.047807

In [13]:
states = np.array(["OH", "CA", "CA", "OH", "OH", "CA", "OH"])
years = [2005, 2005, 2006, 2005, 2006, 2005, 2006]

In [14]:
df["data1"].groupby([states, years]).mean()

CA  2005   -0.276771
    2006   -1.546650
OH  2005   -1.105139
    2006   -1.171609
Name: data1, dtype: float64

In [15]:
df.groupby("key1").mean()

      key2     data1     data2
key1
a      1.5 -0.572005 -0.104380
b      1.5 -1.338967  0.181882

In [16]:
df.groupby("key2").mean()

         data1     data2
key2
1    -1.263085  0.393698
2    -0.867104 -1.155580

In [17]:
df.groupby(["key1", "key2"]).mean()

              data1     data2
key1 key2
a    1    -1.162471  1.090237
     2    -0.686401 -1.510048
b    1    -1.630128  1.164875
     2    -1.047807 -0.801112

In [18]:
df.groupby(["key1", "key2"]).size()

key1  key2
a     1       1
      2       1
b     1       1
      2       1
dtype: int64

In [19]:
df.groupby("key1", dropna=False).size()

key1
a      3
b      2
NaN    2
dtype: int64

In [20]:
df.groupby(["key1", "key2"], dropna=False).size()

key1  key2
a     1       1
      2       1
      <NA>    1
b     1       1
      2       1
NaN   1       2
dtype: int64

In [22]:
df.groupby("key1").count()

      key2  data1  data2
key1
a        2      3      3
b        2      2      2

In [24]:
for name, group in df.groupby("key1"):
    print(name)
    print(group)

a
  key1  key2     data1     data2
0    a     1 -1.162471  1.090237
1    a     2 -0.686401 -1.510048
5    a  <NA>  0.132858  0.106670
b
  key1  key2     data1     data2
3    b     2 -1.047807 -0.801112
4    b     1 -1.630128  1.164875

In [25]:
for (k1, k2), group in df.groupby(["key1", "key2"]):
    print((k1, k2))
    print(group)

('a', 1)
  key1  key2     data1     data2
0    a     1 -1.162471  1.090237
('a', 2)
  key1  key2     data1     data2
1    a     2 -0.686401 -1.510048
('b', 1)
  key1  key2     data1     data2
4    b     1 -1.630128  1.164875
('b', 2)
  key1  key2     data1     data2
3    b     2 -1.047807 -0.801112

In [26]:
pieces = {name: group for name, group in df.groupby("key1")}

In [27]:
pieces["b"]

  key1  key2     data1     data2
3    b     2 -1.047807 -0.801112
4    b     1 -1.630128  1.164875

In [28]:
In [36]: grouped = df.groupby({"key1": "key", "key2": "key",
                               "data1": "data", "data2": "data"}, axis="columns")

In [29]:
for group_key, group_values in grouped:
    print(group_key)
    print(group_values)

data
      data1     data2
0 -1.162471  1.090237
1 -0.686401 -1.510048
2 -1.546650 -1.180442
3 -1.047807 -0.801112
4 -1.630128  1.164875
5  0.132858  0.106670
6 -0.713091  0.500120
key
   key1  key2
0     a     1
1     a     2
2  None     1
3     b     2
4     b     1
5     a  <NA>
6  None     1

In [30]:
df.groupby("key1")["data1"]
df.groupby("key1")[["data2"]]

In [31]:
df["data1"].groupby(df["key1"])
df[["data2"]].groupby(df["key1"])

In [32]:
df.groupby(["key1", "key2"])[["data2"]].mean()

              data2
key1 key2
a    1     1.090237
     2    -1.510048
b    1     1.164875
     2    -0.801112

In [33]:
s_grouped = df.groupby(["key1", "key2"])["data2"]

In [34]:
s_grouped

In [35]:
s_grouped.mean()

key1  key2
a     1       1.090237
      2      -1.510048
b     1       1.164875
      2      -0.801112
Name: data2, dtype: float64

In [37]:
people = pd.DataFrame(np.random.standard_normal((5, 5)),
                      columns=["a", "b", "c", "d", "e"],
                      index=["Joe", "Steve", "Wanda", "Jill", "Trey"])

In [38]:
people.iloc[2:3, [1, 2]] = np.nan # Add a few NA values

In [39]:
people

              a         b         c         d         e
Joe   -1.027276 -2.008332 -1.245523  2.171026 -0.878887
Steve  0.353673 -0.207753  0.787732 -1.517506 -0.631378
Wanda  0.017990       NaN       NaN -0.344695  1.694475
Jill  -0.514983 -0.633987  0.344627  0.039905 -0.128119
Trey  -1.339781 -0.544911  0.315576 -0.715892 -1.114894

In [40]:
mapping = {"a": "red", "b": "red", "c": "blue",
           "d": "blue", "e": "red", "f" : "orange"}

In [41]:
by_column = people.groupby(mapping, axis="columns")

In [42]:
by_column.sum()

           blue       red
Joe    0.925503 -3.914496
Steve -0.729774 -0.485458
Wanda -0.344695  1.712465
Jill   0.384532 -1.277089
Trey  -0.400316 -2.999586

In [43]:
map_series = pd.Series(mapping)

In [44]:
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [45]:
people.groupby(map_series, axis="columns").count()

       blue  red
Joe       2    3
Steve     2    3
Wanda     1    2
Jill      2    3
Trey      2    3

In [46]:
people.groupby(len).sum()

          a         b         c         d         e
3 -1.027276 -2.008332 -1.245523  2.171026 -0.878887
4 -1.854764 -1.178898  0.660203 -0.675987 -1.243013
5  0.371663 -0.207753  0.787732 -1.862201  1.063097

In [47]:
key_list = ["one", "one", "one", "two", "two"]

In [48]:
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one -1.027276 -2.008332 -1.245523  2.171026 -0.878887
4 two -1.339781 -0.633987  0.315576 -0.715892 -1.114894
5 one  0.017990 -0.207753  0.787732 -1.517506 -0.631378

In [49]:
columns = pd.MultiIndex.from_arrays([["US", "US", "US", "JP", "JP"],
                                     [1, 3, 5, 1, 3]],
                                    names=["cty", "tenor"])

In [50]:
hier_df = pd.DataFrame(np.random.standard_normal((4, 5)),
                       columns=columns)

In [51]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0      1.397015 -1.437169 -1.919705  0.190092  1.167560
1     -0.494641  0.524805  2.159740 -1.238925 -1.133610
2     -0.492554 -0.399037 -0.273499  1.478288 -1.243023
3     -0.717709 -1.972376 -1.128090 -1.279382  1.346969

In [52]:
hier_df.groupby(level="cty", axis="columns").count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

In [53]:
df

   key1  key2     data1     data2
0     a     1 -1.162471  1.090237
1     a     2 -0.686401 -1.510048
2  None     1 -1.546650 -1.180442
3     b     2 -1.047807 -0.801112
4     b     1 -1.630128  1.164875
5     a  <NA>  0.132858  0.106670
6  None     1 -0.713091  0.500120

In [54]:
grouped = df.groupby("key1")

In [55]:
grouped["data1"].nsmallest(2)

key1
a     0   -1.162471
      1   -0.686401
b     4   -1.630128
      3   -1.047807
Name: data1, dtype: float64

In [56]:
def peak_to_peak(arr):
    return arr.max() - arr.min()

In [57]:
grouped.agg(peak_to_peak)

      key2    data1     data2
key1
a        1  1.29533  2.600285
b        1  0.58232  1.965987

In [58]:
grouped.describe()

      key2                                           data1            ...  \
     count mean       std  min   25%  50%   75%  max count      mean  ...
key1                                                                  ...
a      2.0  1.5  0.707107  1.0  1.25  1.5  1.75  2.0   3.0 -0.572005  ...
b      2.0  1.5  0.707107  1.0  1.25  1.5  1.75  2.0   2.0 -1.338967  ...

                         data2                                          \
           75%       max count      mean       std       min       25%
key1
a    -0.276771  0.132858   3.0 -0.104380  1.312927 -1.510048 -0.701689
b    -1.193387 -1.047807   2.0  0.181882  1.390163 -0.801112 -0.309615


           50%       75%       max
key1
a     0.106670  0.598454  1.090237
b     0.181882  0.673378  1.164875

[2 rows x 24 columns]

In [59]:
tips = pd.read_csv("tips.csv")

In [60]:
tips

     total_bill   tip smoker   day    time  size
0         16.99  1.01     No   Sun  Dinner     2
1         10.34  1.66     No   Sun  Dinner     3
2         21.01  3.50     No   Sun  Dinner     3
3         23.68  3.31     No   Sun  Dinner     2
4         24.59  3.61     No   Sun  Dinner     4
..          ...   ...    ...   ...     ...   ...
239       29.03  5.92     No   Sat  Dinner     3
240       27.18  2.00    Yes   Sat  Dinner     2
241       22.67  2.00    Yes   Sat  Dinner     2
242       17.82  1.75     No   Sat  Dinner     2
243       18.78  3.00     No  Thur  Dinner     2

[244 rows x 6 columns]

In [61]:
tips["tip_pct"] = tips["tip"] / tips["total_bill"]

In [62]:
tips.head()

   total_bill   tip smoker  day    time  size   tip_pct
0       16.99  1.01     No  Sun  Dinner     2  0.059447
1       10.34  1.66     No  Sun  Dinner     3  0.160542
2       21.01  3.50     No  Sun  Dinner     3  0.166587
3       23.68  3.31     No  Sun  Dinner     2  0.139780
4       24.59  3.61     No  Sun  Dinner     4  0.146808

In [63]:
grouped = tips.groupby(["day", "smoker"])

In [65]:
grouped_pct = grouped["tip_pct"]

In [66]:
grouped_pct.agg("mean")

day   smoker
Fri   No        0.151650
      Yes       0.174783
Sat   No        0.158048
      Yes       0.147906
Sun   No        0.160113
      Yes       0.187250
Thur  No        0.160298
      Yes       0.163863
Name: tip_pct, dtype: float64

In [67]:
grouped_pct.agg(["mean", "std", peak_to_peak])

                 mean       std  peak_to_peak
day  smoker
Fri  No      0.151650  0.028123      0.067349
     Yes     0.174783  0.051293      0.159925
Sat  No      0.158048  0.039767      0.235193
     Yes     0.147906  0.061375      0.290095
Sun  No      0.160113  0.042347      0.193226
     Yes     0.187250  0.154134      0.644685
Thur No      0.160298  0.038774      0.193350
     Yes     0.163863  0.039389      0.151240

In [68]:
grouped_pct.agg([("average", "mean"), ("stdev", np.std)])

              average     stdev
day  smoker
Fri  No      0.151650  0.028123
     Yes     0.174783  0.051293
Sat  No      0.158048  0.039767
     Yes     0.147906  0.061375
Sun  No      0.160113  0.042347
     Yes     0.187250  0.154134
Thur No      0.160298  0.038774
     Yes     0.163863  0.039389

In [69]:
functions = ["count", "mean", "max"]

In [70]:
result = grouped[["tip_pct", "total_bill"]].agg(functions)

In [71]:
result

            tip_pct                     total_bill
              count      mean       max      count       mean    max
day  smoker
Fri  No           4  0.151650  0.187735          4  18.420000  22.75
     Yes         15  0.174783  0.263480         15  16.813333  40.17
Sat  No          45  0.158048  0.291990         45  19.661778  48.33
     Yes         42  0.147906  0.325733         42  21.276667  50.81
Sun  No          57  0.160113  0.252672         57  20.506667  48.17
     Yes         19  0.187250  0.710345         19  24.120000  45.35
Thur No          45  0.160298  0.266312         45  17.113111  41.19
     Yes         17  0.163863  0.241255         17  19.190588  43.11

In [72]:
result["tip_pct"]

             count      mean       max
day  smoker
Fri  No          4  0.151650  0.187735
     Yes        15  0.174783  0.263480
Sat  No         45  0.158048  0.291990
     Yes        42  0.147906  0.325733
Sun  No         57  0.160113  0.252672
     Yes        19  0.187250  0.710345
Thur No         45  0.160298  0.266312
     Yes        17  0.163863  0.241255

In [73]:
ftuples = [("Average", "mean"), ("Variance", np.var)]

In [74]:
grouped[["tip_pct", "total_bill"]].agg(ftuples)

              tip_pct           total_bill
              Average  Variance    Average    Variance
day  smoker
Fri  No      0.151650  0.000791  18.420000   25.596333
     Yes     0.174783  0.002631  16.813333   82.562438
Sat  No      0.158048  0.001581  19.661778   79.908965
     Yes     0.147906  0.003767  21.276667  101.387535
Sun  No      0.160113  0.001793  20.506667   66.099980
     Yes     0.187250  0.023757  24.120000  109.046044
Thur No      0.160298  0.001503  17.113111   59.625081
     Yes     0.163863  0.001551  19.190588   69.808518

In [75]:
grouped.agg({"tip" : np.max, "size" : "sum"})

               tip  size
day  smoker
Fri  No       3.50     9
     Yes      4.73    31
Sat  No       9.00   115
     Yes     10.00   104
Sun  No       6.00   167
     Yes      6.50    49
Thur No       6.70   112
     Yes      5.00    40

In [76]:
grouped.agg({"tip_pct" : ["min", "max", "mean", "std"],
             "size" : "sum"})

              tip_pct                               size
                  min       max      mean       std  sum
day  smoker
Fri  No      0.120385  0.187735  0.151650  0.028123    9
     Yes     0.103555  0.263480  0.174783  0.051293   31
Sat  No      0.056797  0.291990  0.158048  0.039767  115
     Yes     0.035638  0.325733  0.147906  0.061375  104
Sun  No      0.059447  0.252672  0.160113  0.042347  167
     Yes     0.065660  0.710345  0.187250  0.154134   49
Thur No      0.072961  0.266312  0.160298  0.038774  112
     Yes     0.090014  0.241255  0.163863  0.039389   40

In [77]:
tips.groupby(["day", "smoker"], as_index=False).mean()

    day smoker  total_bill       tip      size   tip_pct
0   Fri     No   18.420000  2.812500  2.250000  0.151650
1   Fri    Yes   16.813333  2.714000  2.066667  0.174783
2   Sat     No   19.661778  3.102889  2.555556  0.158048
3   Sat    Yes   21.276667  2.875476  2.476190  0.147906
4   Sun     No   20.506667  3.167895  2.929825  0.160113
5   Sun    Yes   24.120000  3.516842  2.578947  0.187250
6  Thur     No   17.113111  2.673778  2.488889  0.160298
7  Thur    Yes   19.190588  3.030000  2.352941  0.163863

In [78]:
def top(df, n=5, column="tip_pct"):
    return df.sort_values(column, ascending=False)[:n]

In [79]:
top(tips, n=6)

     total_bill   tip smoker  day    time  size   tip_pct
172        7.25  5.15    Yes  Sun  Dinner     2  0.710345
178        9.60  4.00    Yes  Sun  Dinner     2  0.416667
67         3.07  1.00    Yes  Sat  Dinner     1  0.325733
232       11.61  3.39     No  Sat  Dinner     2  0.291990
183       23.17  6.50    Yes  Sun  Dinner     4  0.280535
109       14.31  4.00    Yes  Sat  Dinner     2  0.279525

In [80]:
tips.groupby("smoker").apply(top)

            total_bill   tip smoker   day    time  size   tip_pct
smoker
No     232       11.61  3.39     No   Sat  Dinner     2  0.291990
       149        7.51  2.00     No  Thur   Lunch     2  0.266312
       51        10.29  2.60     No   Sun  Dinner     2  0.252672
       185       20.69  5.00     No   Sun  Dinner     5  0.241663
       88        24.71  5.85     No  Thur   Lunch     2  0.236746
Yes    172        7.25  5.15    Yes   Sun  Dinner     2  0.710345
       178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
       67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
       183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
       109       14.31  4.00    Yes   Sat  Dinner     2  0.279525

In [81]:
tips.groupby(["smoker", "day"]).apply(top, n=1, column="total_bill")

                 total_bill    tip smoker   day    time  size   tip_pct
smoker day
No     Fri  94        22.75   3.25     No   Fri  Dinner     2  0.142857
       Sat  212       48.33   9.00     No   Sat  Dinner     4  0.186220
       Sun  156       48.17   5.00     No   Sun  Dinner     6  0.103799
       Thur 142       41.19   5.00     No  Thur   Lunch     5  0.121389
Yes    Fri  95        40.17   4.73    Yes   Fri  Dinner     4  0.117750
       Sat  170       50.81  10.00    Yes   Sat  Dinner     3  0.196812
       Sun  182       45.35   3.50    Yes   Sun  Dinner     3  0.077178
       Thur 197       43.11   5.00    Yes  Thur   Lunch     4  0.115982

In [82]:
result = tips.groupby("smoker")["tip_pct"].describe()

In [83]:
result

,count,mean,std,min,25%,50%,75%,max
smoker,,,,,,,,
No,151.0,0.159328,0.039910,0.056797,0.136906,0.155625,0.185014,0.291990
Yes,93.0,0.163196,0.085119,0.035638,0.106771,0.153846,0.195059,0.710345

In [84]:
result.unstack("smoker")

       smoker
count  No        151.000000
       Yes        93.000000
mean   No          0.159328
       Yes         0.163196
std    No          0.039910
       Yes         0.085119
min    No          0.056797
       Yes         0.035638
25%    No          0.136906
       Yes         0.106771
50%    No          0.155625
       Yes         0.153846
75%    No          0.185014
       Yes         0.195059
max    No          0.291990
       Yes         0.710345
dtype: float64

In [85]:
def f(group):
    return group.describe()

grouped.apply(f)

                   total_bill       tip  size   tip_pct
day  smoker
Fri  No     count    4.000000  4.000000  4.00  4.000000
            mean    18.420000  2.812500  2.25  0.151650
            std      5.059282  0.898494  0.50  0.028123
            min     12.460000  1.500000  2.00  0.120385
            25%     15.100000  2.625000  2.00  0.137239
...                       ...       ...   ...       ...
Thur Yes    min     10.340000  2.000000  2.00  0.090014
            25%     13.510000  2.000000  2.00  0.148038
            50%     16.470000  2.560000  2.00  0.153846
            75%     19.810000  4.000000  2.00  0.194837
            max     43.110000  5.000000  4.00  0.241255

[64 rows x 4 columns]

In [86]:
tips.groupby("smoker", group_keys=False).apply(top)

     total_bill   tip smoker   day    time  size   tip_pct
232       11.61  3.39     No   Sat  Dinner     2  0.291990
149        7.51  2.00     No  Thur   Lunch     2  0.266312
51        10.29  2.60     No   Sun  Dinner     2  0.252672
185       20.69  5.00     No   Sun  Dinner     5  0.241663
88        24.71  5.85     No  Thur   Lunch     2  0.236746
172        7.25  5.15    Yes   Sun  Dinner     2  0.710345
178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
109       14.31  4.00    Yes   Sat  Dinner     2  0.279525

In [87]:
frame = pd.DataFrame({"data1": np.random.standard_normal(1000),
                      "data2": np.random.standard_normal(1000)})

In [88]:
frame.head()

      data1     data2
0 -0.457112 -0.487739
1 -1.232249 -1.055130
2  0.599282  0.662835
3 -0.576968 -1.256911
4 -0.061653  0.336723

In [89]:
quartiles = pd.cut(frame["data1"], 4)

In [90]:
quartiles

0      (-1.913, -0.0918]
1      (-1.913, -0.0918]
2        (-0.0918, 1.73]
3      (-1.913, -0.0918]
4        (-0.0918, 1.73]
             ...
995      (-0.0918, 1.73]
996        (1.73, 3.551]
997    (-1.913, -0.0918]
998        (1.73, 3.551]
999      (-0.0918, 1.73]
Name: data1, Length: 1000, dtype: category
Categories (4, interval[float64, right]): [(-3.742, -1.913] < (-1.913, -0.0918] < (-0.0918, 1.73] < (1.73, 3.551]]

In [91]:
quartiles.head(10)

0    (-1.913, -0.0918]
1    (-1.913, -0.0918]
2      (-0.0918, 1.73]
3    (-1.913, -0.0918]
4      (-0.0918, 1.73]
5      (-0.0918, 1.73]
6    (-1.913, -0.0918]
7        (1.73, 3.551]
8        (1.73, 3.551]
9    (-1.913, -0.0918]
Name: data1, dtype: category
Categories (4, interval[float64, right]): [(-3.742, -1.913] < (-1.913, -0.0918] < (-0.0918, 1.73] < (1.73, 3.551]]

In [92]:
def get_stats(group):
    return pd.DataFrame(
        {"min": group.min(), "max": group.max(),
         "count": group.count(), "mean": group.mean()})

In [93]:
grouped = frame.groupby(quartiles)

In [94]:
grouped.apply(get_stats)

                              min       max  count      mean
data1
(-3.742, -1.913]  data1 -3.734943 -1.914149     31 -2.358209
                  data2 -2.404060  2.330232     31  0.030961
(-1.913, -0.0918] data1 -1.906587 -0.095271    450 -0.778641
                  data2 -2.820909  2.815626    450 -0.019477
(-0.0918, 1.73]   data1 -0.089648  1.726048    471  0.627492
                  data2 -3.252885  3.480804    471 -0.037147
(1.73, 3.551]     data1  1.733133  3.551416     48  2.230655
                  data2 -2.358729  1.916359     48 -0.098426

In [95]:
grouped.agg(["min", "max", "count", "mean"])

                      data1                               data2            \
                        min       max count      mean       min       max
data1
(-3.742, -1.913]  -3.734943 -1.914149    31 -2.358209 -2.404060  2.330232
(-1.913, -0.0918] -1.906587 -0.095271   450 -0.778641 -2.820909  2.815626
(-0.0918, 1.73]   -0.089648  1.726048   471  0.627492 -3.252885  3.480804
(1.73, 3.551]      1.733133  3.551416    48  2.230655 -2.358729  1.916359


                  count      mean
data1
(-3.742, -1.913]     31  0.030961
(-1.913, -0.0918]   450 -0.019477
(-0.0918, 1.73]     471 -0.037147
(1.73, 3.551]        48 -0.098426

In [96]:
quartiles_samp = pd.qcut(frame["data1"], 4, labels=False)

In [97]:
quartiles_samp.head()

0    1
1    0
2    2
3    1
4    1
Name: data1, dtype: int64

In [98]:
grouped = frame.groupby(quartiles_samp)

In [99]:
grouped.apply(get_stats)

                  min       max  count      mean
data1
0     data1 -3.734943 -0.729986    250 -1.321540
      data2 -2.677070  2.815626    250 -0.048617
1     data1 -0.719354 -0.045311    250 -0.377385
      data2 -2.820909  2.810570    250  0.033279
2     data1 -0.043803  0.694187    250  0.303813
      data2 -3.252885  3.480804    250 -0.028442
3     data1  0.695748  3.551416    250  1.311622
      data2 -2.358729  2.769302    250 -0.076322

In [100]:
s = pd.Series(np.random.standard_normal(6))

In [101]:
s[::2] = np.nan

In [102]:
s

0         NaN
1   -2.298298
2         NaN
3    0.134074
4         NaN
5   -0.332059
dtype: float64

In [103]:
s.fillna(s.mean())

0   -0.832094
1   -2.298298
2   -0.832094
3    0.134074
4   -0.832094
5   -0.332059
dtype: float64

In [104]:
states = ["Ohio", "New York", "Vermont", "Florida",
          "Oregon", "Nevada", "California", "Idaho"]

In [105]:
group_key = ["East", "East", "East", "East",
             "West", "West", "West", "West"]

In [106]:
data = pd.Series(np.random.standard_normal(8), index=states)

In [107]:
data

Ohio         -0.249348
New York      0.554367
Vermont       2.173615
Florida       1.987817
Oregon        1.014163
Nevada       -1.462422
California   -0.734086
Idaho        -0.251954
dtype: float64

In [108]:
data[["Vermont", "Nevada", "Idaho"]] = np.nan

In [109]:
data

Ohio         -0.249348
New York      0.554367
Vermont            NaN
Florida       1.987817
Oregon        1.014163
Nevada             NaN
California   -0.734086
Idaho              NaN
dtype: float64

In [110]:
data.groupby(group_key).size()

East    4
West    4
dtype: int64

In [111]:
data.groupby(group_key).count()

East    3
West    2
dtype: int64

In [112]:
data.groupby(group_key).mean()

East    0.764279
West    0.140038
dtype: float64

In [113]:
def fill_mean(group):
    return group.fillna(group.mean())

In [114]:
data.groupby(group_key).apply(fill_mean)

Ohio         -0.249348
New York      0.554367
Vermont       0.764279
Florida       1.987817
Oregon        1.014163
Nevada        0.140038
California   -0.734086
Idaho         0.140038
dtype: float64

In [115]:
fill_values = {"East": 0.5, "West": -1}

In [116]:
def fill_func(group):
    return group.fillna(fill_values[group.name])

In [117]:
data.groupby(group_key).apply(fill_func)

Ohio         -0.249348
New York      0.554367
Vermont       0.500000
Florida       1.987817
Oregon        1.014163
Nevada       -1.000000
California   -0.734086
Idaho        -1.000000
dtype: float64

In [118]:
suits = ["H", "S", "C", "D"]  # Hearts, Spades, Clubs, Diamonds
card_val = (list(range(1, 11)) + [10] * 3) * 4
base_names = ["A"] + list(range(2, 11)) + ["J", "K", "Q"]
cards = []
for suit in suits:
    cards.extend(str(num) + suit for num in base_names)

deck = pd.Series(card_val, index=cards)

In [119]:
deck.head(13)

AH      1
2H      2
3H      3
4H      4
5H      5
6H      6
7H      7
8H      8
9H      9
10H    10
JH     10
KH     10
QH     10
dtype: int64

In [120]:
def draw(deck, n=5):
    return deck.sample(n)

In [121]:
draw(deck)

5H     5
2D     2
QC    10
2S     2
6C     6
dtype: int64

In [122]:
def get_suit(card):
    # last letter is suit
    return card[-1]

In [123]:
deck.groupby(get_suit).apply(draw, n=2)

C  QC    10
   4C     4
D  2D     2
   JD    10
H  8H     8
   JH    10
S  5S     5
   AS     1
dtype: int64

In [124]:
deck.groupby(get_suit, group_keys=False).apply(draw, n=2)

9C     9
7C     7
JD    10
7D     7
4H     4
8H     8
9S     9
KS    10
dtype: int64

In [125]:
df = pd.DataFrame({"category": ["a", "a", "a", "a",
                                "b", "b", "b", "b"],
                   "data": np.random.standard_normal(8),
                   "weights": np.random.uniform(size=8)})

In [126]:
df

  category      data   weights
0        a -1.279356  0.456444
1        a  0.172692  0.804492
2        a -2.148739  0.736658
3        a -1.514593  0.434942
4        b -1.840617  0.189083
5        b  0.097091  0.240458
6        b  0.186609  0.442336
7        b  0.464552  0.433061

In [127]:
grouped = df.groupby("category")

In [128]:
def get_wavg(group):
    return np.average(group["data"], weights=group["weights"])

In [129]:
grouped.apply(get_wavg)

category
a   -1.104473
b   -0.031389
dtype: float64

In [131]:
close_px = pd.read_csv("stock_px.csv", parse_dates=True,
                       index_col=0)

In [132]:
close_px

              AAPL   MSFT    XOM      SPX
2003-01-02    7.40  21.11  29.22   909.03
2003-01-03    7.45  21.14  29.24   908.59
2003-01-06    7.45  21.52  29.96   929.01
2003-01-07    7.43  21.93  28.95   922.93
2003-01-08    7.28  21.31  28.83   909.93
...            ...    ...    ...      ...
2011-10-10  388.81  26.94  76.28  1194.89
2011-10-11  400.29  27.00  76.27  1195.54
2011-10-12  402.19  26.96  77.16  1207.25
2011-10-13  408.43  27.18  76.37  1203.66
2011-10-14  422.00  27.27  78.11  1224.58

[2214 rows x 4 columns]

In [133]:
close_px.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 2214 entries, 2003-01-02 to 2011-10-14
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   AAPL    2214 non-null   float64
 1   MSFT    2214 non-null   float64
 2   XOM     2214 non-null   float64
 3   SPX     2214 non-null   float64
dtypes: float64(4)
memory usage: 86.5 KB

In [134]:
close_px.tail(4)

              AAPL   MSFT    XOM      SPX
2011-10-11  400.29  27.00  76.27  1195.54
2011-10-12  402.19  26.96  77.16  1207.25
2011-10-13  408.43  27.18  76.37  1203.66
2011-10-14  422.00  27.27  78.11  1224.58

In [135]:
def spx_corr(group):
    return group.corrwith(group["SPX"])

In [136]:
rets = close_px.pct_change().dropna()

In [137]:
def get_year(x):
    return x.year

In [138]:
by_year = rets.groupby(get_year)

In [139]:
by_year.apply(spx_corr)

          AAPL      MSFT       XOM  SPX
2003  0.541124  0.745174  0.661265  1.0
2004  0.374283  0.588531  0.557742  1.0
2005  0.467540  0.562374  0.631010  1.0
2006  0.428267  0.406126  0.518514  1.0
2007  0.508118  0.658770  0.786264  1.0
2008  0.681434  0.804626  0.828303  1.0
2009  0.707103  0.654902  0.797921  1.0
2010  0.710105  0.730118  0.839057  1.0
2011  0.691931  0.800996  0.859975  1.0

In [140]:
def corr_aapl_msft(group):
    return group["AAPL"].corr(group["MSFT"])

In [141]:
by_year.apply(corr_aapl_msft)

2003    0.480868
2004    0.259024
2005    0.300093
2006    0.161735
2007    0.417738
2008    0.611901
2009    0.432738
2010    0.571946
2011    0.581987
dtype: float64

In [143]:
df = pd.DataFrame({'key': ['a', 'b', 'c'] * 4,
                   'value': np.arange(12.)})

In [144]:
df

   key  value
0    a    0.0
1    b    1.0
2    c    2.0
3    a    3.0
4    b    4.0
5    c    5.0
6    a    6.0
7    b    7.0
8    c    8.0
9    a    9.0
10   b   10.0
11   c   11.0

In [145]:
g = df.groupby('key')['value']

In [146]:
g.mean()

key
a    4.5
b    5.5
c    6.5
Name: value, dtype: float64

In [147]:
def get_mean(group):
    return group.mean()

In [148]:
g.transform(get_mean)

0     4.5
1     5.5
2     6.5
3     4.5
4     5.5
5     6.5
6     4.5
7     5.5
8     6.5
9     4.5
10    5.5
11    6.5
Name: value, dtype: float64

In [149]:
g.transform('mean')

0     4.5
1     5.5
2     6.5
3     4.5
4     5.5
5     6.5
6     4.5
7     5.5
8     6.5
9     4.5
10    5.5
11    6.5
Name: value, dtype: float64

In [150]:
def times_two(group):
    return group * 2

In [151]:
g.transform(times_two)

0      0.0
1      2.0
2      4.0
3      6.0
4      8.0
5     10.0
6     12.0
7     14.0
8     16.0
9     18.0
10    20.0
11    22.0
Name: value, dtype: float64

In [152]:
def get_ranks(group):
    return group.rank(ascending=False)

In [153]:
g.transform(get_ranks)

0     4.0
1     4.0
2     4.0
3     3.0
4     3.0
5     3.0
6     2.0
7     2.0
8     2.0
9     1.0
10    1.0
11    1.0
Name: value, dtype: float64

In [154]:
def normalize(x):
    return (x - x.mean()) / x.std()

In [155]:
g.transform(normalize)

0    -1.161895
1    -1.161895
2    -1.161895
3    -0.387298
4    -0.387298
5    -0.387298
6     0.387298
7     0.387298
8     0.387298
9     1.161895
10    1.161895
11    1.161895
Name: value, dtype: float64

In [156]:
g.apply(normalize)

0    -1.161895
1    -1.161895
2    -1.161895
3    -0.387298
4    -0.387298
5    -0.387298
6     0.387298
7     0.387298
8     0.387298
9     1.161895
10    1.161895
11    1.161895
Name: value, dtype: float64

In [157]:
g.transform('mean')

0     4.5
1     5.5
2     6.5
3     4.5
4     5.5
5     6.5
6     4.5
7     5.5
8     6.5
9     4.5
10    5.5
11    6.5
Name: value, dtype: float64

In [158]:
normalized = (df['value'] - g.transform('mean')) / g.transform('std')

In [159]:
normalized

0    -1.161895
1    -1.161895
2    -1.161895
3    -0.387298
4    -0.387298
5    -0.387298
6     0.387298
7     0.387298
8     0.387298
9     1.161895
10    1.161895
11    1.161895
Name: value, dtype: float64

In [160]:
tips.head()

   total_bill   tip smoker  day    time  size   tip_pct
0       16.99  1.01     No  Sun  Dinner     2  0.059447
1       10.34  1.66     No  Sun  Dinner     3  0.160542
2       21.01  3.50     No  Sun  Dinner     3  0.166587
3       23.68  3.31     No  Sun  Dinner     2  0.139780
4       24.59  3.61     No  Sun  Dinner     4  0.146808

In [161]:
tips.pivot_table(index=["day", "smoker"])

                 size       tip   tip_pct  total_bill
day  smoker
Fri  No      2.250000  2.812500  0.151650   18.420000
     Yes     2.066667  2.714000  0.174783   16.813333
Sat  No      2.555556  3.102889  0.158048   19.661778
     Yes     2.476190  2.875476  0.147906   21.276667
Sun  No      2.929825  3.167895  0.160113   20.506667
     Yes     2.578947  3.516842  0.187250   24.120000
Thur No      2.488889  2.673778  0.160298   17.113111
     Yes     2.352941  3.030000  0.163863   19.190588

In [162]:
tips.pivot_table(index=["time", "day"], columns="smoker",
                 values=["tip_pct", "size"])

                 size             tip_pct
smoker             No       Yes        No       Yes
time   day
Dinner Fri   2.000000  2.222222  0.139622  0.165347
       Sat   2.555556  2.476190  0.158048  0.147906
       Sun   2.929825  2.578947  0.160113  0.187250
       Thur  2.000000       NaN  0.159744       NaN
Lunch  Fri   3.000000  1.833333  0.187735  0.188937
       Thur  2.500000  2.352941  0.160311  0.163863

In [163]:
tips.pivot_table(index=["time", "day"], columns="smoker",
                 values=["tip_pct", "size"], margins=True)

                 size                       tip_pct
smoker             No       Yes       All        No       Yes       All
time   day
Dinner Fri   2.000000  2.222222  2.166667  0.139622  0.165347  0.158916
       Sat   2.555556  2.476190  2.517241  0.158048  0.147906  0.153152
       Sun   2.929825  2.578947  2.842105  0.160113  0.187250  0.166897
       Thur  2.000000       NaN  2.000000  0.159744       NaN  0.159744
Lunch  Fri   3.000000  1.833333  2.000000  0.187735  0.188937  0.188765
       Thur  2.500000  2.352941  2.459016  0.160311  0.163863  0.161301
All          2.668874  2.408602  2.569672  0.159328  0.163196  0.160803

In [165]:
tips.pivot_table(index=["time", "smoker"], columns="day",
                 values="tip_pct", aggfunc=len, margins=True)

day             Fri   Sat   Sun  Thur  All
time   smoker
Dinner No       3.0  45.0  57.0   1.0  106
       Yes      9.0  42.0  19.0   NaN   70
Lunch  No       1.0   NaN   NaN  44.0   45
       Yes      6.0   NaN   NaN  17.0   23
All            19.0  87.0  76.0  62.0  244

In [166]:
tips.pivot_table(index=["time", "size", "smoker"], columns="day",values="tip_pct", fill_value=0)

day                      Fri       Sat       Sun      Thur
time   size smoker
Dinner 1    No      0.000000  0.137931  0.000000  0.000000
            Yes     0.000000  0.325733  0.000000  0.000000
       2    No      0.139622  0.162705  0.168859  0.159744
            Yes     0.171297  0.148668  0.207893  0.000000
       3    No      0.000000  0.154661  0.152663  0.000000
            Yes     0.000000  0.144995  0.152660  0.000000
       4    No      0.000000  0.150096  0.148143  0.000000
            Yes     0.117750  0.124515  0.193370  0.000000
       5    No      0.000000  0.000000  0.206928  0.000000
            Yes     0.000000  0.106572  0.065660  0.000000
       6    No      0.000000  0.000000  0.103799  0.000000
Lunch  1    No      0.000000  0.000000  0.000000  0.181728
            Yes     0.223776  0.000000  0.000000  0.000000
       2    No      0.000000  0.000000  0.000000  0.166005
            Yes     0.181969  0.000000  0.000000  0.158843
       3    No      0.187735  0.000000  0.000000  0.084246
            Yes     0.000000  0.000000  0.000000  0.204952
       4    No      0.000000  0.000000  0.000000  0.138919
            Yes     0.000000  0.000000  0.000000  0.155410
       5    No      0.000000  0.000000  0.000000  0.121389
       6    No      0.000000  0.000000  0.000000  0.173706

In [167]:
from io import StringIO

In [168]:
data = """Sample  Nationality  Handedness
    1   USA  Right-handed
    2   Japan    Left-handed
    3   USA  Right-handed
    4   Japan    Right-handed
    5   Japan    Left-handed
    6   Japan    Right-handed
    7   USA  Right-handed
    8   USA  Left-handed
    9   Japan    Right-handed
    10  USA  Right-handed"""

In [169]:
data

'Sample  Nationality  Handedness\n    1   USA  Right-handed\n    2   Japan    Left-handed\n    3   USA  Right-handed\n    4   Japan    Right-handed\n    5   Japan    Left-handed\n    6   Japan    Right-handed\n    7   USA  Right-handed\n    8   USA  Left-handed\n    9   Japan    Right-handed\n    10  USA  Right-handed'

In [170]:
data = pd.read_table(StringIO(data), sep="\s+")

In [171]:
data

   Sample Nationality    Handedness
0       1         USA  Right-handed
1       2       Japan   Left-handed
2       3         USA  Right-handed
3       4       Japan  Right-handed
4       5       Japan   Left-handed
5       6       Japan  Right-handed
6       7         USA  Right-handed
7       8         USA   Left-handed
8       9       Japan  Right-handed
9      10         USA  Right-handed

In [172]:
pd.crosstab(data["Nationality"], data["Handedness"], margins=True)

Handedness   Left-handed  Right-handed  All
Nationality
Japan                  2             3    5
USA                    1             4    5
All                    3             7   10

In [173]:
pd.crosstab([tips["time"], tips["day"]], tips["smoker"], margins=True)

smoker        No  Yes  All
time   day
Dinner Fri     3    9   12
       Sat    45   42   87
       Sun    57   19   76
       Thur    1    0    1
Lunch  Fri     1    6    7
       Thur   44   17   61
All          151   93  244